<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2fba916f28635a451fe6ed74c3519d5338a795d732a39938d1bccb073dc6906c","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #969 at https://github.com/cal-itp/data-infra/actions/runs/19351327949","plan_out_hash":"5335fb221c1be35ab421d26de92288c6dbed34021ca7754c9b06ef07ef3b5105","plan_hash":"685d16875034b55cf1ec3dc94d9b15f6831d558a6decbbcaf01ba6a40f2e16c6","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 10 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/airtable_loader_v2/generate_gtfs_download_configs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "LLSRKg==" -> (known after apply)
!~      detect_md5hash      = "WEFwfVbJm4J6LdTF0abD2A==" -> "different hash"
!~      generation          = 1751416672748889 -> (known after apply)
        id                  = "calitp-composer-dags/airtable_loader_v2/generate_gtfs_download_configs.py"
!~      md5hash             = "WEFwfVbJm4J6LdTF0abD2A==" -> (known after apply)
        name                = "dags/airtable_loader_v2/generate_gtfs_download_configs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/download_schedule_feeds.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "LW/cjQ==" -> (known after apply)
!~      detect_md5hash      = "v4OSHRGL1Pqn5UkuoYrJ+g==" -> "different hash"
!~      generation          = 1762306517423010 -> (known after apply)
        id                  = "calitp-composer-dags/download_gtfs_schedule_v2/download_schedule_feeds.py"
!~      md5hash             = "v4OSHRGL1Pqn5UkuoYrJ+g==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/download_schedule_feeds.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "PtTDYA==" -> (known after apply)
!~      detect_md5hash      = "MD9Xa0febR52D/2WC0YF7w==" -> "different hash"
!~      generation          = 1762556093238687 -> (known after apply)
        id                  = "calitp-composer-dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
!~      md5hash             = "MD9Xa0febR52D/2WC0YF7w==" -> (known after apply)
        name                = "dags/sync_ntd_data_xlsx/scrape_ntd_xlsx_urls.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/dbt_manifest_to_dictionary_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "bQa2fw==" -> (known after apply)
!~      detect_md5hash      = "dQSSAJQ1XwwivACFbt1IQA==" -> "different hash"
!~      generation          = 1759879834012514 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/dbt_manifest_to_dictionary_operator.py"
!~      md5hash             = "dQSSAJQ1XwwivACFbt1IQA==" -> (known after apply)
        name                = "plugins/operators/dbt_manifest_to_dictionary_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/dbt_manifest_to_metadata_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "WdYbdQ==" -> (known after apply)
!~      detect_md5hash      = "6YJokkpPp3C3zbJVHFBRww==" -> "different hash"
!~      generation          = 1759879834025172 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/dbt_manifest_to_metadata_operator.py"
!~      md5hash             = "6YJokkpPp3C3zbJVHFBRww==" -> (known after apply)
        name                = "plugins/operators/dbt_manifest_to_metadata_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/littlepay_raw_sync_feed_v3.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "SUn8gQ==" -> (known after apply)
!~      detect_md5hash      = "2naYzWkGG8DDy2GEHVMuYw==" -> "different hash"
!~      generation          = 1751416671285972 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/littlepay_raw_sync_feed_v3.py"
!~      md5hash             = "2naYzWkGG8DDy2GEHVMuYw==" -> (known after apply)
        name                = "plugins/operators/littlepay_raw_sync_feed_v3.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/scrape_ntd_xlsx.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "1vdq2w==" -> (known after apply)
!~      detect_md5hash      = "JswrPXbC0ODbp33GpR/6Fw==" -> "different hash"
!~      generation          = 1762556093245704 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/scrape_ntd_xlsx.py"
!~      md5hash             = "JswrPXbC0ODbp33GpR/6Fw==" -> (known after apply)
        name                = "plugins/operators/scrape_ntd_xlsx.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/scrape_state_geoportal.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "3pMECQ==" -> (known after apply)
!~      detect_md5hash      = "qwOK0bYTQ/9mzvdFyKCNGQ==" -> "different hash"
!~      generation          = 1751416675477427 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/scrape_state_geoportal.py"
!~      md5hash             = "qwOK0bYTQ/9mzvdFyKCNGQ==" -> (known after apply)
        name                = "plugins/operators/scrape_state_geoportal.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/scripts/gtfs_rt_parser.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "qYETHA==" -> (known after apply)
!~      detect_md5hash      = "1sRWG9gMSF57EIUYXiLLHw==" -> "different hash"
!~      generation          = 1759360707524627 -> (known after apply)
        id                  = "calitp-composer-plugins/scripts/gtfs_rt_parser.py"
!~      md5hash             = "1sRWG9gMSF57EIUYXiLLHw==" -> (known after apply)
        name                = "plugins/scripts/gtfs_rt_parser.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/utils.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "ZshQSQ==" -> (known after apply)
!~      detect_md5hash      = "7UdL9NZ+pHtC/CmwXFEL0g==" -> "different hash"
!~      generation          = 1751416670997258 -> (known after apply)
        id                  = "calitp-composer-plugins/utils.py"
!~      md5hash             = "7UdL9NZ+pHtC/CmwXFEL0g==" -> (known after apply)
        name                = "plugins/utils.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 10 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #969](https://github.com/cal-itp/data-infra/actions/runs/19351327949)